app/controllers/jobs_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
---
  def destroy
    @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    @user = User.find(params[:user_id])