app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("birthdate", "created_at", "email", "firstname", "lastname", "location", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "email" = 'asdfasd@asdf.com', "password" = '1234556', "updated_at" = '2012-08-12 21:53:42.528584' WHERE "users"."id" = 6

  def invite
    @userEmail = params[:signUpEmail]
    @existingEmails = User.where('email =?',@userEmail).count
---
SELECT COUNT(*) FROM "users" WHERE (email ='jagadish.d.one@gmail.com')